# Count Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCollection..::..Count Property
PointCollection Class See Also
---
The number of points in this collection.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int Count { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Count As Integer
	Get
```

Visual C++
---
```text
public:
property int Count {
	int get ();
}
```

# See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace